#+title: Reference_abstracts

* Code

#+BEGIN_SRC python :session reference_abstracts.org  :exports both
from pathlib import Path


with open(Path("~/").expanduser() / ".keys/perplexity_api_key.txt") as f:
    PERPLEXITY_API_KEY = f.read().strip()
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session reference_abstracts.org  :exports both
import requests
import xmltodict
from bs4 import BeautifulSoup

def extract_abstract(html_content):
    # Parse the HTML content
    soup = BeautifulSoup(html_content, 'html.parser')

    # Find the blockquote element with class "abstract mathjax"
    abstract_element = soup.find('blockquote', class_='abstract mathjax')

    # Check if the abstract element is found
    if abstract_element:
        # Extract the text inside the abstract element
        abstract_text = abstract_element.text
        return abstract_text.strip().strip("Abstract:")

    return None



def xml_to_dict(xml_data):
    return xmltodict.parse(xml_data)

paper_id = "2408.03910"
abs_url = f"http://arxiv.org/abs/{paper_id}"

response = requests.get(abs_url)
abstract = extract_abstract(response.content)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC python :session reference_abstracts.org  :exports both
response.text
#+END_SRC

#+RESULTS:
#+begin_example
<?xml version="1.0" encoding="UTF-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <link href="http://arxiv.org/api/query?search_query%3D%26id_list%3D2408.03910%26start%3D0%26max_results%3D10" rel="self" type="application/atom+xml"/>
  <title type="html">ArXiv Query: search_query=&amp;id_list=2408.03910&amp;start=0&amp;max_results=10</title>
  <id>http://arxiv.org/api/DyTKYxvdlzcv6hpzf6N1k+JEMWw</id>
  <updated>2024-08-11T00:00:00-04:00</updated>
  <opensearch:totalResults xmlns:opensearch="http://a9.com/-/spec/opensearch/1.1/">1</opensearch:totalResults>
  <opensearch:startIndex xmlns:opensearch="http://a9.com/-/spec/opensearch/1.1/">0</opensearch:startIndex>
  <opensearch:itemsPerPage xmlns:opensearch="http://a9.com/-/spec/opensearch/1.1/">10</opensearch:itemsPerPage>
  <entry>
    <id>http://arxiv.org/abs/2408.03910v1</id>
    <updated>2024-08-07T17:13:59Z</updated>
    <published>2024-08-07T17:13:59Z</published>
    <title>CodexGraph: Bridging Large Language Models and Code Repositories via
  Code Graph Databases</title>
    <summary>  Large Language Models (LLMs) excel in stand-alone code tasks like HumanEval
and MBPP, but struggle with handling entire code repositories. This challenge
has prompted research on enhancing LLM-codebase interaction at a repository
scale. Current solutions rely on similarity-based retrieval or manual tools and
APIs, each with notable drawbacks. Similarity-based retrieval often has low
recall in complex tasks, while manual tools and APIs are typically
task-specific and require expert knowledge, reducing their generalizability
across diverse code tasks and real-world applications. To mitigate these
limitations, we introduce \framework, a system that integrates LLM agents with
graph database interfaces extracted from code repositories. By leveraging the
structural properties of graph databases and the flexibility of the graph query
language, \framework enables the LLM agent to construct and execute queries,
allowing for precise, code structure-aware context retrieval and code
navigation. We assess \framework using three benchmarks: CrossCodeEval,
SWE-bench, and EvoCodeBench. Additionally, we develop five real-world coding
applications. With a unified graph database schema, \framework demonstrates
competitive performance and potential in both academic and real-world
environments, showcasing its versatility and efficacy in software engineering.
Our application demo:
https://github.com/modelscope/modelscope-agent/tree/master/apps/codexgraph_agent.
</summary>
    <author>
      <name>Xiangyan Liu</name>
    </author>
    <author>
      <name>Bo Lan</name>
    </author>
    <author>
      <name>Zhiyuan Hu</name>
    </author>
    <author>
      <name>Yang Liu</name>
    </author>
    <author>
      <name>Zhicheng Zhang</name>
    </author>
    <author>
      <name>Wenmeng Zhou</name>
    </author>
    <author>
      <name>Fei Wang</name>
    </author>
    <author>
      <name>Michael Shieh</name>
    </author>
    <arxiv:comment xmlns:arxiv="http://arxiv.org/schemas/atom">work in progress</arxiv:comment>
    <link href="http://arxiv.org/abs/2408.03910v1" rel="alternate" type="text/html"/>
    <link title="pdf" href="http://arxiv.org/pdf/2408.03910v1" rel="related" type="application/pdf"/>
    <arxiv:primary_category xmlns:arxiv="http://arxiv.org/schemas/atom" term="cs.SE" scheme="http://arxiv.org/schemas/atom"/>
    <category term="cs.SE" scheme="http://arxiv.org/schemas/atom"/>
    <category term="cs.AI" scheme="http://arxiv.org/schemas/atom"/>
    <category term="cs.CL" scheme="http://arxiv.org/schemas/atom"/>
  </entry>
</feed>
#+end_example
